



# 1-დან 100-მდე დაითვალეთ ხუთის ჯერადი რიცხვების ჯამი
sum = 0

for i in range(5, 101, 5):
    sum += i

print("The total sum is:", sum)


#2 დან 100 მდე დაბეჭდეთ ყოველი ლუწი რიცხვი და მიუწერეთ მათ რომ ლუწია, შემდეგ 1 და 100 მდე დაბეჭდეთ ყოველი კენტი რიცხვი და მიუწერეთ რომ კენტია, გამოიყენეთ მხოლოდ ლუპი




for i in range(1, 100, 2):
    
   print(str(i) + " is odd")


for i in range(2, 100, 2):

    print(str(i) + " is even")





   # 3 1-დან 100-მდე დაითვალეთ ხუთის ჯერადი რიცხვების ჯამი გამოიყენეთ if, else გამოგადგებათ % ნიშანი
sum = 0

for i in range(1, 101):
    if i % 5 == 0:
        sum += i

print("ხუთის ჯერადი რიცხვების ჯამია:", sum)

