# სასაცილო სახელების სია
funny_names = [
    "ფლაფი ბარაბანიანი",
    "მშვენიერი კრეპი",
    "თვითმფრინავი ზამბახი",
    "ჭკვიანი ბაჭია",
    "ტანტალი პომიდორი",
    "გიგანტური ლიმონი",
    "ზაფხულის ნაყინი",
    "შავი ჯინსები",
    "თოვლის საბურავი",
    "სასაცილო კარტოფილი"
]

# სახელების დაბეჭდვა
print(funny_names)



# შექმენით მეორე რომელშიც მოათავსებთ ყველა ლუწ რიცხვს 1 დან 20 მდ

# ლუწი რიცხვების სია 1-დან 20-მდე
even = [2, 4, 6, 8, 10, 12, 14, 16, 18, 20]

# წყვილი რიცხვების სია 1-დან 20-მდე
odd = [1, 3, 5, 7, 9, 11, 13, 15, 17, 19]

# სიის დაბეჭდვა
print("ლუწი რიცხვები:", even)
print("წყვილი რიცხვები:", odd)

#შექმენით მესამე სია რომელშიც მოათავსებთ ყველა 5ის ჯერად რიცხვებს 1 დან 30 მდე

# 5-ის ჯერად რიცხვების სია 1-დან 30-მდე
multiples_of_5 = [5, 25]

# სიის დაბეჭდვა
print(multiples_of_5)

