// # შედარების ოპერატორი	მაგალითი	შედეგი
// # == (ტოლობა)	5 == 5	True
// # "Hello" == "Hi"	False
// # 10 == "10"	False
// # [1, 2] == [1, 2]	True
// # ("a", "b") == ("a", "b")	True
// # != (არ უდრის)	მაგალითი	შედეგი
// # 5 != 3	True	
// # 10 != 10	False	
// # "abc" != "ABC"	True	
// # [1, 2] != [2, 1]	True	
// # (4, 5) != (4, 5)	False	
// # > (მეტია ვიდრე)	მაგალითი	შედეგი
// # 7 > 3	True	
// # 2 > 9	False	
// # 5 > 5	False	
// # -1 > -5	True	
// # 100 > 50	True	
// # < (ნაკლებია ვიდრე)	მაგალითი	შედეგი
// # 3 < 10	True	
// # 7 < 3	False	
// # 5 < 5	False	
// # -10 < -5	True	
// # 1 < 100	True	
// # >= (მეტია ან ტოლია)	მაგალითი	შედეგი
// # 8 >= 8	True	
// # 5 >= 2	True	
// # 3 >= 4	False	
// # -1 >= -1	True	
// # 100 >= 50	True	
// # <= (ნაკლებია ან ტოლია)	მაგალითი	შედეგი
// # 10 <= 10	True	
// # 4 <= 8	True	
// # 7 <= 3	False	
// # -5 <= -5	True	
// # 0 <= 1	True	